shier121221/SLV262--/5.相关资料/代码备份/SLV262---main/5.相关资料/红外成像资料/MLX90642_STM32F103C8T6_参考例程/HARDWAVE/MLX90642/myiic.h
#ifndef __MYIIC_H
#define __MYIIC_H

#include "stm32f10x.h"
#include "delay.h"

#define I2Cx_SCL_PIN            GPIO_Pin_8
#define I2Cx_SCL_GPIO_PORT      GPIOB
#define I2Cx_SCL_GPIO_CLK       RCC_APB2Periph_GPIOB

#define I2Cx_SDA_PIN            GPIO_Pin_9
#define I2Cx_SDA_GPIO_PORT      GPIOB
#define I2Cx_SDA_GPIO_CLK       RCC_APB2Periph_GPIOB

#define I2C_SCL_HIGH()      GPIO_SetBits(I2Cx_SCL_GPIO_PORT, I2Cx_SCL_PIN)
#define I2C_SCL_LOW()       GPIO_ResetBits(I2Cx_SCL_GPIO_PORT, I2Cx_SCL_PIN)
#define I2C_SCL_READ()      GPIO_ReadInputDataBit(I2Cx_SCL_GPIO_PORT, I2Cx_SCL_PIN)

#define I2C_SDA_HIGH()      GPIO_SetBits(I2Cx_SDA_GPIO_PORT, I2Cx_SDA_PIN)
#define I2C_SDA_LOW()       GPIO_ResetBits(I2Cx_SDA_GPIO_PORT, I2Cx_SDA_PIN)
#define I2C_SDA_READ()      GPIO_ReadInputDataBit(I2Cx_SDA_GPIO_PORT, I2Cx_SDA_PIN)

void i2c_delay(void);
void i2c_config(void);
void i2c_start(void);
void i2c_stop(void);
unsigned char i2c_send_byte(uint8_t data);
uint8_t i2c_receive_byte(unsigned char ack);
u8 i2c_wait_ack(void);
void i2c_ack(void);
void i2c_no_ack(void);
uint8_t I2CReceiveAck(uint8_t timeout);
void I2CReadBytes(int nBytes, char *dataP);
void i2c_Wait(int t);
#endif
